[
    {
      "author": "Ruth ",
      "story": "My name is Ruth, I'm a Nigerian. When I was much younger, I had a surgery on my leg which disfigured me. I grew up with low self-esteem because I felt I was a misfit. It affected everything about me; my choice of outfits, my relationship with people, when I hangout most times I remain sitting until everyone else leaves because I dtrangers to know this fine girl limbs. It has been a struggle really. It affected my relationship with the opposite sex so much that I believe I lacked hot legs which should be a prerequisite for dating and I turned down most advances because I d be left heartbroken at the end of the day. My background too dtters as I was born into a poor family and yes I shouldn't have anything to do with rich folks be it men or women. I always feel I should not be close to wealthy people because we are worlds apart. After my Passing Out Parade from NYSC, last year June, I started job hunting and it yielded nothing positive. My colleagues were getting jobs here and there, but I could not find one. I kept having mix feelings; feelings of maybe because I limp, and I do not have connections and money to secure a job. It was a really challenging period of my life because I was a shadow of myself, nothing really excites me, I saw every word of encouragement from people as motivational speeches. So sometime around August or September last year, I can't remember vivt month, I was invited to join Self Esteem Diary group. Accepting the invite was the beginning of my healing I must say. I could not help but repost some of the posts because it was indeed timely, and I wanted someone to benefit from the posts too. Some posts were timely, I couldn't help but be grateful because I intentionally decthis one life I have to the fullest regardless of life's happenings. I would like to say a very big thank you to the founder of this group. God bless you for being an instrument of push to living positively Ma'am. More grace. Happy one-year anniversary SELF ESTEEM DIARY. Cheers to many impacts ahead. 🙏♥️ "
    },
    {
      "author": "Sianesse  ",
      "story": "At first, I wasn't okay with myself, I doubted myself a lot about my looks and my feelings. And one thing that I was struggling with a lot was that I cared a lot about people's opinion about me. I cringed a lot around people, I wasn't comfortable around people being scared that they will judge me and that leaded me to low self-esteem and that prevented me from doing things that I like to do. But I saw your group and I joined hoping that I can get help and your posts really encouraged me so I deca direct message to the founder of the group and I told her my story, like talking to her was the best thing. I ddged, I was heard. When I needed advice you were there, you encouraged me a lot. You taught me how to listen to my feelings, you taught me to not really care about people's opinion that people will always talk. You made me know that I am worthy, beautiful, and unique. And I really don't know how to thank you, you are truly a blessing and I hope you will continue to help people who are hopeless out there. Thank you so much❤❤ "
    },
    {
      "author": "Thato ",
      "story": "Greetings to all members of the group. My name is Thato. I am from South Africa in Free State. This is my story and I hope it will encourage other victims of low self-esteem. After the death of my mother, I changed into a stranger to myself, but it took time before I could notice. I no longer enjoyed being at school because I always compared myself to others. I forgot to appreciate the little I have. I became this shy person and I was always quiet. I saw myself as ugly and I d to be among others. My communication with others became bad because I was now suffering from a low self-esteem problem. The confyears ago faded away.I realized I need help. I saw that I need someone to talk to. Then I met this wonderful lady, Rosemary Ochiwu😊. She helped me to regain my confould always advise me to accept who I am and love myself more than anything.To other victims of low self-esteem out there my advice is every problem you face in life creates a star and when these stars line up, they create something beautiful which is you. Loving yourself is a big part of you 👏❤. Slowly but surely everything will fall into place. I would like to say a very big thank you to the founder of this group, God bless you for being an instrument of push to living positively ma'am. More grace. Happy first anniversary to SELF ESTEEM DIARY. Cheers to many impacts ahead. 🙏♥️ "
    },
    {
      "author": "Perpetual ",
      "story": "Actually, it's a great thing ever discovering this group, I must say it's a blessing and one of the best thinsg that ever happened to me to have discovered that a group like this do exist. I have been feeling so depressed and lonely for some years now having no one to share my feelings with. Low self-esteem is the worst thing that would ever happen to a person. At times, I have to lock myself up, I never wanna show my face especially when I see my mates (females), I do feel inferior whenever I come across my fellow girls until I joined this group. This group has enlightened me a lot though still on some certain issue but at least I now know how to overcome some issues. I must say a big thanks to the sole founder of this group (Miss Rosemary Ochiwu). My God will bless you. She was always there for me. Miss Rosemary, you've done a lot for me and I pray that God's wisdom and blessings will never depart from you. Thanks"
    },
    {
      "author": "Alwande ",
      "story": "Greetings to all members, I'm so glad for the opportunity to share my story. I'm a 16-year-old girl and I was a victim of low self-esteem. My Mom and Dad are divorced because of their problems. l don't know their problems pretty well. So, when they divorced, my mom went to stay with her family while my brother and I stayed with my father's family. So, when we plead for my mom to visit us or when my mom pleads for us to visit her, they don't allow us. And they ended up asking us to choose between my mom and dad. Because of what happened to us, I failed my exam and my self-esteem ended up low, and I was always thinking negatively about myself. I even thought that I am useless, and it was my fault that they divorced. Until I met this lady Rosemary Ochiwu. She helped me a lot, she changed my negative mindset. I'm so grateful to her and her group. I wish you guys carry on helping millions of teenagers who have the same problem as me.  May God bless you guys. My name is Alwande from South Africa"
    },
    {
      "author": "Thabiso ",
      "story": "Hi, my good friends from the self-esteem group. My name is Thabiso from South Africa in Pretoria. When I started this group, I was from a situation where I come from a drug addiction problem. I used to smoke heroin for almost 15 years of my life. When I entered this group about 5 months back, I was a broken man who always felt rejected and these things are only happening to me I had a low self-esteem, always thought I was a looser and I have nowhere to go and no one to share my problems with. But I found this group and this lady I don't know physically, Rosemary Ochiwu. She gave me a warm welcome after telling her my story. She really encouraged me a lot only by chatting with her on this group. Her posts made me realize that my problem is that I have a low self-esteem. Since then, I have been growing day by day until I ended up not blaming other people for my wrong decisions but now I am overcoming every temptation I come across and it's a victory for me cause my life has changed a lot. I'm not perfect but I'm striving for success. Thank you"
    }
  ]