[
    {
            "projectName": "PROJECT H.E.L.P.",
      "projectDetails": " In March 2022, we heard about the story of a 15 years old girl in Galadimawa community in FCT-Abuja, who grew up with a father that constantly demoralized her and threatened to kill them. She developed chronic low self-esteem & an intense need to be loved and accepted which made her easy prey for a sexual predator. He took advantage of her low self-esteem & manipulated her into making nude vlls with him which he recorded and eventually, it found its way online. After a visit to the community, we birthed Project H.E.L.P. to teach children within about the importance of self-esteem and its place in preventing sexual abuse. We raised the sum of 193,000 naira through peer to peer fundraising campaign for the project.",
      "projectsPhotos": "/images/projectHelpHero.jpg"
    },
    {
            "projectName": "TEENAGE HANGOUT 1.0",
      "projectDetails": "In line with our goals, to build a network of young people that respects each other's indivy, we began an annual hangout for young people. We had over 25 people in attendance. We spoke to them about the vision of the organization, the importance of self-esteem, and its place in helping us achieve our dreams. We also created time for the young people to know each other, organized games, and ate. ",
      
      "projectsPhotos": "/images/hangout1.jpeg"
    },
    {
            "projectName": "TEENAGE HANGOUT 2.0 ",
      "projectDetails": "This was the second edition of a yearly program we began in 2022. Through these hangouts, we fuse fun and learning to create awareness about self esteem and low self esteem. For this edition, we partnered with an NGO advocating for SDG 4, Nigeria Reads, to give age appropriate books to all attendees. By giving them those books, we invested in their personal development and expanded their capacities to dream bigger. Hangout 2.0 also featured a pitch competition after which we awarded scholarships to 6 children until the completion of their secondary education. ",
      "projectsPhotos": "/images/hangout2.jpeg"
    },
    {
            "projectName": "ADVOCACY PROGRAM ",
      "projectDetails": "On the heel of international women's day, 2022, we were invited to an orphanage home to speak to the children about the importance of self-esteem and its impact on our ability to achieve our dreams.We were represented by our founder, Rosemary Ochiwu",
      "projectsPhotos": "/images/advocacyProgram.jpeg"
    },
    {
            "projectName": "WEBINARS & GROUP SESSIONS ",
      "projectDetails": "Our engagement with community members on Facebook revealed that a major cause of low self-esteem is lack of personal development. To solve this, we began monthly webinar series and weekly engagement. We had guest speakers discuss diverse issues that impacted personal growth career wise and ae development of social skills like emotional intelligence. Our weekly engagement sessions is anchored by team members on WhatsApp. It features topics that affect our self esteem and ultimately, our mental health and well being",
      "projectsPhotos": "/images/webinar.jpeg"
    }
]
  
  